           >>source format free
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.
AUTHOR. AMBER.
DATE-WRITTEN. SEPTEMBER 18.
ENVIRONMENT DIVISION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.

01 WS-NAME PIC A(30) VALUE 'ABCDEF'.
*> these are re-writable, like a 'let' variable in Javascript
01 WS-ID PIC 9(5).
01 WS-ADRESS.
       05 WS-HOUSE-NUMBER PIC 9(3).
       05 WS-COUNTRY PIC X(50).
       05 WS-PINCODE PIC 9(6) VALUE 123456.

PROCEDURE DIVISION.

INITIALIZE WS-NAME, WS-ADRESS.
INITIALIZE WS-ID REPLACING NUMERIC DATA BY 12345.
DISPLAY "What is your name? ".
ACCEPT WS-NAME.
DISPLAY "My name is    : " WS-NAME.
DISPLAY "My ID is      : " WS-ID.
DISPLAY "Address       : " WS-ADRESS.
DISPLAY "House number  : " WS-HOUSE-NUMBER.
DISPLAY "Pincode       : " WS-PINCODE.

STOP RUN.
